[
    {
      "date": "2025-10-26",
      "title": "“BB Adventure” Featured on TV Tokyo’s “ii eeeee Park”!",
      "content": "On October 26 (Sun) from 22:48 to 22:54, BB Adventure was featured on TV Tokyo’s program “ii eeeee Park,” including interviews with the developers and impressions from visitors who played the game at our Tokyo Game Show 2025 booth.",
      "link": "",
      "image": ""
    },
    {
      "date": "2025-10-12",
      "title": "BB Adventure Introduced on NHK’s “Game Genome: Tokyo Game Show 2025 Special”!",
      "content": "BB Adventure, a physical action game by Yamamu Games, was featured on NHK’s “Game Genome: Tokyo Game Show 2025 Special,” broadcast on October 12, 2025 (12:35–1:20 AM). The show featured artists Daichi Miura and Tettou competing on balance balls in an exciting head-to-head match that lit up the studio. Don’t miss the re-airing or online streaming!",
      "link": "https://www.web.nhk/tv/pl/series-tep-LJWWVGY6J2/ep/W3Q41J9KJ6",
      "image": ""
    },
    {
      "date": "2025-09-26",
      "title": "BB Adventure Wins the “Best Technological Game Award” at TGS 2025!",
      "content": "Yamamu Games’ BB Adventure received the “Best Technological Game Award” at Tokyo Game Show 2025’s official event, Sense of Wonder Night (SOWN). The game’s unique motion-control technology was highly praised for its innovation.",
      "link": "https://tgs.cesa.or.jp/jp/news/detail/41016",
      "image": ""
    },
    {
      "date": "2025-07-09",
      "title": "BB Adventure Selected for “Sense of Wonder Night 2025” and Exhibited at Tokyo Game Show 2025!",
      "content": "BB Adventure by Yamamu Games was officially selected for the indie game showcase “Sense of Wonder Night 2025” at Tokyo Game Show 2025. The game will be exhibited at the TGS Indie Game Area, where visitors can experience hands-on gameplay. Please check the official SOWN website for more details.",
      "link": "https://tgs.cesa.or.jp/jp/sow",
      "image": ""
    },
    {
      "date": "2025-05-04",
      "title": "BB Adventure Exhibited at Tokyo Game Dungeon 8!",
      "content": "Yamamu Games exhibited BB Adventure at Tokyo Game Dungeon 8 on May 4, 2025. Many visitors enjoyed hands-on gameplay and gave us wonderful feedback. Thank you to everyone who stopped by our booth!",
      "link": "https://gamedungeon.jp/events/tokyo8",
      "image": ""
    }
  ]
  